{
  "slug": "donna-lichaw",
  "quotes": [
    {
      "id": "donna-lichaw-001",
      "speaker": "Donna Lichaw",
      "text": "The most effective stories are the ones that we tell ourselves. They may or may not be true; our brain doesn't know the difference. Once you can really understand that, you may as well leverage it to be that hero.",
      "timestamp": "00:10:43",
      "source": {
        "slug": "donna-lichaw",
        "path": "episodes/donna-lichaw/transcript.md",
        "lineStart": 109,
        "lineEnd": 109
      },
      "themes": ["self-narrative", "mindset", "leadership"],
      "zones": ["intuition", "discovery"]
    },
    {
      "id": "donna-lichaw-002",
      "speaker": "Donna Lichaw",
      "text": "You need to flip that, which is when you start with you first at the center of the equation. When you figure that out and you come from the inside out, it's much, much more powerful because it's not selfish like I would've thought years ago, but it's purposeful.",
      "timestamp": "00:13:13",
      "source": {
        "slug": "donna-lichaw",
        "path": "episodes/donna-lichaw/transcript.md",
        "lineStart": 118,
        "lineEnd": 121
      },
      "themes": ["self-leadership", "purpose", "inside-out"],
      "zones": ["intuition", "focus"]
    },
    {
      "id": "donna-lichaw-003",
      "speaker": "Donna Lichaw",
      "text": "Take a data-driven approach to the stories that you tell yourself. The story, 'I'm too nice,' it could be true, it could not be true. How did we get down to the bottom of that? I went out there and talked to his team. And I found out how people actually experienced him and his leadership.",
      "timestamp": "00:16:55",
      "source": {
        "slug": "donna-lichaw",
        "path": "episodes/donna-lichaw/transcript.md",
        "lineStart": 136,
        "lineEnd": 136
      },
      "themes": ["data-driven", "self-awareness", "feedback"],
      "zones": ["data", "discovery"]
    },
    {
      "id": "donna-lichaw-004",
      "speaker": "Donna Lichaw",
      "text": "What if you took a counter-intuitive approach and looked at that story, I'm an imposter, and instead asked, 'Okay, that's a good story. How is that serving you?' Imposter syndrome, it's something everyone has at one point or another. We default to that because it's serving us in one way, otherwise it wouldn't become a habit.",
      "timestamp": "00:27:08",
      "source": {
        "slug": "donna-lichaw",
        "path": "episodes/donna-lichaw/transcript.md",
        "lineStart": 181,
        "lineEnd": 181
      },
      "themes": ["imposter-syndrome", "reframing", "self-awareness"],
      "zones": ["intuition", "chaos"]
    },
    {
      "id": "donna-lichaw-005",
      "speaker": "Donna Lichaw",
      "text": "I liken it to kryptonite — the things that we think harm us, actually when we look at how they serve us, they can serve a function. Like kryptonite for Superman, it's how people are able to operate on him. They use a little kryptonite so they could get in there and do some surgery and then get out. It serves a function, but when it's too much that can be detrimental.",
      "timestamp": "00:31:42",
      "source": {
        "slug": "donna-lichaw",
        "path": "episodes/donna-lichaw/transcript.md",
        "lineStart": 199,
        "lineEnd": 199
      },
      "themes": ["kryptonite", "self-awareness", "growth"],
      "zones": ["discovery", "intuition"]
    },
    {
      "id": "donna-lichaw-006",
      "speaker": "Donna Lichaw",
      "text": "When we play to our strengths, we're much more effective than when we try to fix what's broken. It's a waste of energy to fix what's broken for the most part. But when you can amplify your strengths and figure out how to use them productively so that you can fulfill your purpose, meet your goals, do what you need to do in life and bring others along with you, it's just that you're such a bigger impact that way.",
      "timestamp": "00:37:53",
      "source": {
        "slug": "donna-lichaw",
        "path": "episodes/donna-lichaw/transcript.md",
        "lineStart": 229,
        "lineEnd": 229
      },
      "themes": ["strengths", "impact", "energy-management"],
      "zones": ["focus", "intuition"]
    },
    {
      "id": "donna-lichaw-007",
      "speaker": "Donna Lichaw",
      "text": "Pull your superpowers out of your stories from your past and your present, and then eventually figure out how to apply them and transpose them to your future. If you look at your peak experiences from life, from work, but especially from life, and you can lay them on top of one another, what you see at key moments is your superpowers popping through.",
      "timestamp": "00:44:04",
      "source": {
        "slug": "donna-lichaw",
        "path": "episodes/donna-lichaw/transcript.md",
        "lineStart": 274,
        "lineEnd": 277
      },
      "themes": ["superpowers", "self-discovery", "peak-experiences"],
      "zones": ["discovery", "intuition"]
    },
    {
      "id": "donna-lichaw-008",
      "speaker": "Donna Lichaw",
      "text": "She kept being told her superpower was 'attention to detail' and she hated it. But when we looked at her past and her stories, she was really great at connecting things together — connecting themes, connecting pieces, trends and connecting people; connecting ideas together, and then connecting people to ideas. That being a connector was one of her superpowers.",
      "timestamp": "00:45:59",
      "source": {
        "slug": "donna-lichaw",
        "path": "episodes/donna-lichaw/transcript.md",
        "lineStart": 280,
        "lineEnd": 286
      },
      "themes": ["superpowers", "connector", "identity"],
      "zones": ["discovery", "alignment"]
    },
    {
      "id": "donna-lichaw-009",
      "speaker": "Donna Lichaw",
      "text": "If you're using your superpowers, you will have more energy. If you use them too much, then it's going to detract. But you want to be doing more of what lights you up, more of what you love, and figuring out how to manage the rest, whether it's outsourcing or sometimes fixing. But we don't have to fix everything.",
      "timestamp": "00:54:46",
      "source": {
        "slug": "donna-lichaw",
        "path": "episodes/donna-lichaw/transcript.md",
        "lineStart": 373,
        "lineEnd": 373
      },
      "themes": ["energy-management", "strengths", "delegation"],
      "zones": ["focus", "alignment"]
    },
    {
      "id": "donna-lichaw-010",
      "speaker": "Donna Lichaw",
      "text": "When you want to create real lasting powerful change, you don't do it by forcing change to happen, you instead do it by embracing what is and what's working and then figuring out how to leverage that. You don't just go and change everything or do it all at once, you take one tiny step and run a little experiment to get data.",
      "timestamp": "01:02:23",
      "source": {
        "slug": "donna-lichaw",
        "path": "episodes/donna-lichaw/transcript.md",
        "lineStart": 430,
        "lineEnd": 430
      },
      "themes": ["experimentation", "change-management", "gestalt"],
      "zones": ["discovery", "data"]
    },
    {
      "id": "donna-lichaw-011",
      "speaker": "Donna Lichaw",
      "text": "Start with the ending. Come up with how you want things to turn out, and then work your way back. Really imagine. Close your eyes; imagine you're there. Engage all your senses. What do you hear? What do you smell? What do you see? Who do you see? What do you feel emotionally, physically? And what are you doing? What have you accomplished?",
      "timestamp": "01:13:06",
      "source": {
        "slug": "donna-lichaw",
        "path": "episodes/donna-lichaw/transcript.md",
        "lineStart": 478,
        "lineEnd": 478
      },
      "themes": ["vision", "goal-setting", "visualization"],
      "zones": ["intuition", "focus"]
    }
  ],
  "themes": ["self-narrative", "mindset", "leadership", "self-leadership", "purpose", "data-driven", "self-awareness", "feedback", "imposter-syndrome", "reframing", "kryptonite", "growth", "strengths", "impact", "energy-management", "superpowers", "self-discovery", "peak-experiences", "experimentation", "change-management", "vision", "goal-setting"],
  "takeaways": [
    "The stories we tell ourselves shape our reality more than external storytelling — taking a data-driven approach to test those internal narratives (like 'I'm too nice' or 'nobody listens to me') against feedback from colleagues can be transformative.",
    "Imposter syndrome can be functional: rather than fighting it, ask how it's serving you — it often signals a growth edge and drives people to work harder and learn faster.",
    "Your weaknesses (kryptonite) often contain hidden superpowers — the key is understanding how they serve you in small doses rather than trying to eliminate them entirely.",
    "Identify your superpowers by examining peak experiences across your life, especially childhood — lay these stories on top of each other and look for recurring themes of when you were at your best.",
    "Effective personal change follows the same principles as product development: run small experiments, gather data through head/heart/hands filters, and iterate rather than trying to transform everything at once."
  ],
  "zone_influence": {
    "velocity": 0.05,
    "perfection": 0.05,
    "discovery": 0.25,
    "data": 0.10,
    "intuition": 0.30,
    "alignment": 0.10,
    "chaos": 0.05,
    "focus": 0.10
  },
  "contrarian_candidates": [
    {
      "quoteId": "donna-lichaw-004",
      "why": "Challenges the common advice to overcome imposter syndrome — instead argues you should embrace it and ask how it's serving you, since the discomfort is often a productive growth signal.",
      "related_zones": ["intuition", "chaos"]
    },
    {
      "quoteId": "donna-lichaw-002",
      "why": "Flips the user-centered leadership model on its head — argues effective leadership starts with yourself at the center, not your team or customers, which goes against the dominant 'servant leadership' narrative in tech.",
      "related_zones": ["intuition", "focus"]
    }
  ],
  "guest_metadata": {
    "guest_type": "advisor",
    "company_stage": "mixed",
    "primary_topics": ["executive-coaching", "self-leadership", "superpowers-and-kryptonite"]
  }
}
