{
  "slug": "graham-weaver",
  "quotes": [
    {
      "id": "graham-weaver-001",
      "speaker": "Graham Weaver",
      "text": "After about five or 10 minutes into that, I can tell that their heart and their soul and their energy is really for B. That's really what they want, but they're talking themselves out of B, and they're going to talk themselves into A. So what I try to do is first, I try to let them realize that their real energy is for B, just let them feel that and understand that.",
      "timestamp": "00:06:56",
      "source": {
        "slug": "graham-weaver",
        "path": "episodes/graham-weaver/transcript.md",
        "lineStart": 100,
        "lineEnd": 100
      },
      "themes": ["self-awareness", "career-decisions", "intuition"],
      "zones": ["intuition", "discovery"]
    },
    {
      "id": "graham-weaver-002",
      "speaker": "Graham Weaver",
      "text": "The first exercise is just write all that down. Just get it down on paper, and then two things will happen. One is when you get it down on paper, it will almost immediately strip that limiting belief of a lot of its power and a lot of its scariness. A lot of that scariness becomes just a to-do item. In the recesses of your subconscious, that is a very scary, limiting belief that will actually keep you from doing the thing you love. Once it's on paper, now it's just a to-do item.",
      "timestamp": "00:19:15",
      "source": {
        "slug": "graham-weaver",
        "path": "episodes/graham-weaver/transcript.md",
        "lineStart": 172,
        "lineEnd": 172
      },
      "themes": ["limiting-beliefs", "self-awareness", "frameworks"],
      "zones": ["chaos", "focus"]
    },
    {
      "id": "graham-weaver-003",
      "speaker": "Graham Weaver",
      "text": "Once I got into the path of the thing that I was excited about, that's when I really felt my energy change dramatically. And I developed almost a superpower in that thing, because I had more energy. I was willing to work longer, I was willing to do it. I thought about it in the shower. I thought about it when I went on runs. I talked to people. They wanted to join because I was excited. And it was a whole different level of power and life force.",
      "timestamp": "00:24:31",
      "source": {
        "slug": "graham-weaver",
        "path": "episodes/graham-weaver/transcript.md",
        "lineStart": 208,
        "lineEnd": 208
      },
      "themes": ["passion", "energy", "founder-journey", "leadership"],
      "zones": ["intuition", "velocity"]
    },
    {
      "id": "graham-weaver-004",
      "speaker": "Graham Weaver",
      "text": "The formula you're solving for is you, excited about something for a decade or more. The decade or more is going to come true more likely if you're excited about it. But also, you have to go in at the beginning with that mindset and the structural ability to stay at it for a long period of time. So the missing ingredient in most of the people that fail is time.",
      "timestamp": "00:27:25",
      "source": {
        "slug": "graham-weaver",
        "path": "episodes/graham-weaver/transcript.md",
        "lineStart": 223,
        "lineEnd": 223
      },
      "themes": ["persistence", "long-term-thinking", "success"],
      "zones": ["focus", "chaos"]
    },
    {
      "id": "graham-weaver-005",
      "speaker": "Graham Weaver",
      "text": "The first job I had, I wasn't suffering any less. I was getting on planes, I was working late hours. My time was not my own. So I'm doing that anyway. I'm just doing it for something I don't care about. And then I start my own company and I was suffering, getting on planes, doing all that. It was just something that I cared about. Life is suffering. So figure out something worth suffering for. You're going to suffer either way.",
      "timestamp": "00:30:28",
      "source": {
        "slug": "graham-weaver",
        "path": "episodes/graham-weaver/transcript.md",
        "lineStart": 241,
        "lineEnd": 241
      },
      "themes": ["resilience", "purpose", "suffering", "founder-journey"],
      "zones": ["chaos", "intuition"]
    },
    {
      "id": "graham-weaver-006",
      "speaker": "Graham Weaver",
      "text": "In each case, the first move is negative. The first move is negative to getting in shape. The first move is negative to get out of a bad relationship, to get into a career you want to be in. The reason I think that's important to say is because if I'm optimizing for tomorrow and I just want to have a great day tomorrow, I'm going to stay exactly where I am, because my life will be better tomorrow if I don't make any changes.",
      "timestamp": "00:32:05",
      "source": {
        "slug": "graham-weaver",
        "path": "episodes/graham-weaver/transcript.md",
        "lineStart": 250,
        "lineEnd": 250
      },
      "themes": ["change", "comfort-zone", "growth", "decision-making"],
      "zones": ["chaos", "velocity"]
    },
    {
      "id": "graham-weaver-007",
      "speaker": "Graham Weaver",
      "text": "The formula, I think, for greatness is to be intentional, get in the path of the thing that you're most excited about, and then give yourself several decades to do it. And that's based on investing in 600 companies and building my own business.",
      "timestamp": "00:35:48",
      "source": {
        "slug": "graham-weaver",
        "path": "episodes/graham-weaver/transcript.md",
        "lineStart": 274,
        "lineEnd": 274
      },
      "themes": ["greatness", "intentionality", "long-term-thinking", "investing"],
      "zones": ["focus", "intuition"]
    },
    {
      "id": "graham-weaver-008",
      "speaker": "Graham Weaver",
      "text": "I'd say this to all your listeners: you will get more done writing down your goal and three things you're going to do to move toward that goal, you'll get more things done in three months than you will in three years without that.",
      "timestamp": "00:41:59",
      "source": {
        "slug": "graham-weaver",
        "path": "episodes/graham-weaver/transcript.md",
        "lineStart": 316,
        "lineEnd": 316
      },
      "themes": ["goal-setting", "accountability", "productivity", "frameworks"],
      "zones": ["focus", "velocity"]
    },
    {
      "id": "graham-weaver-009",
      "speaker": "Graham Weaver",
      "text": "There might be one of these lives that gives you the most energy, and it's the thing if you knew you wouldn't fail, you would do this one. And it's good to recognize what that is and then pull that life a little bit into your current life. Just the act of pulling something into your life you're really excited about will give you a tremendous amount of energy.",
      "timestamp": "00:45:10",
      "source": {
        "slug": "graham-weaver",
        "path": "episodes/graham-weaver/transcript.md",
        "lineStart": 334,
        "lineEnd": 337
      },
      "themes": ["nine-lives", "energy", "career-design", "frameworks"],
      "zones": ["intuition", "chaos"]
    },
    {
      "id": "graham-weaver-010",
      "speaker": "Graham Weaver",
      "text": "In 20 years of teaching, I've never had a student come to me and say, 'My real dream is to do X, but I'm just going to give up on it.' No one's ever said that. Instead, they say, 'Not now.' And not now, if they're not careful, will turn into not ever, because not now is just really another way of saying, 'I'm not going to do it.'",
      "timestamp": "00:47:21",
      "source": {
        "slug": "graham-weaver",
        "path": "episodes/graham-weaver/transcript.md",
        "lineStart": 352,
        "lineEnd": 352
      },
      "themes": ["procrastination", "urgency", "self-deception", "action"],
      "zones": ["velocity", "chaos"]
    },
    {
      "id": "graham-weaver-011",
      "speaker": "Graham Weaver",
      "text": "You're writing a story about what it is you think you need to be happy, or you're writing a story about things you think you need to be enough or to be respected or to feel worthy. You're writing that story, and it's just a story. When you start to open this up, it's really kind of scary at first, because you'll start to realize most of the things you're operating from are really just stories. And so it's actually terrifying at first, and then it starts to become really liberating.",
      "timestamp": "00:50:52",
      "source": {
        "slug": "graham-weaver",
        "path": "episodes/graham-weaver/transcript.md",
        "lineStart": 367,
        "lineEnd": 367
      },
      "themes": ["self-awareness", "internal-scorecard", "mindfulness", "identity"],
      "zones": ["intuition", "discovery"]
    }
  ],
  "themes": ["intentionality", "limiting-beliefs", "long-term-thinking", "energy", "suffering", "self-awareness", "accountability", "career-design"],
  "takeaways": [
    "The missing ingredient in most failures is time - success often takes a decade or more, and the willingness to stay with something through prolonged difficulty is the single biggest differentiator between those who succeed and those who don't.",
    "Limiting beliefs lose their power when you write them down - what feels like a paralyzing fear in your subconscious becomes a manageable to-do item on paper, transforming vague anxiety into concrete problems you can solve.",
    "Everything you want is on the other side of 'worse first' - the first move toward any meaningful change is always negative, and optimizing for tomorrow's comfort guarantees you'll plateau indefinitely.",
    "'Not now' is the most dangerous phrase for your dreams - no one explicitly gives up on their aspirations, they just perpetually defer them, and deferral is abandonment in disguise.",
    "The true game of life is internal, not external - achieving external milestones changes nothing about how you feel about yourself, and the stories you tell yourself about what you need to be happy are just stories that can be rewritten."
  ],
  "zone_influence": {
    "velocity": 0.10,
    "perfection": 0.00,
    "discovery": 0.05,
    "data": 0.00,
    "intuition": 0.30,
    "alignment": 0.05,
    "chaos": 0.25,
    "focus": 0.25
  },
  "contrarian_candidates": [
    {
      "quoteId": "graham-weaver-005",
      "why": "Reframes suffering as inevitable and universal rather than something to minimize - contradicts optimization culture by saying you'll suffer regardless, so choose meaningful suffering",
      "related_zones": ["chaos", "intuition"]
    },
    {
      "quoteId": "graham-weaver-006",
      "why": "Argues the first move toward anything worthwhile is always negative - challenges the startup culture obsession with quick wins and immediate positive ROI",
      "related_zones": ["chaos", "velocity"]
    },
    {
      "quoteId": "graham-weaver-010",
      "why": "Claims 'not now' is functionally identical to 'never' - challenges the common wisdom of waiting for the right time or proper preparation",
      "related_zones": ["velocity", "chaos"]
    }
  ],
  "guest_metadata": {
    "guest_type": "founder",
    "company_stage": "growth",
    "primary_topics": ["intentionality", "career-design", "limiting-beliefs", "long-term-thinking"]
  }
}