{
  "slug": "jason-feifer",
  "quotes": [
    {
      "id": "jason-feifer-001",
      "speaker": "Jason Feifer",
      "text": "Think about press the same way that you think about raising money, which is to say you do it when you know what the money is for, and you should do it when you know what the press is for. A lot of people reach out to me at such an early stage that if we wrote about them, it wouldn't get them anything.",
      "timestamp": "00:09:02",
      "source": {
        "slug": "jason-feifer",
        "path": "episodes/jason-feifer/transcript.md",
        "lineStart": 109,
        "lineEnd": 109
      },
      "themes": ["strategy", "press", "timing"],
      "zones": ["focus", "data"]
    },
    {
      "id": "jason-feifer-002",
      "speaker": "Jason Feifer",
      "text": "Entrepreneur is not going to do that for him. Full stop. Why? Because Entrepreneur reaches a national to international audience. So that means that 99.5% of the people who would read a story about this guy have no ability to go get his hotdogs, which means that that was wasted effort.",
      "timestamp": "00:11:52",
      "source": {
        "slug": "jason-feifer",
        "path": "episodes/jason-feifer/transcript.md",
        "lineStart": 120,
        "lineEnd": 121
      },
      "themes": ["audience", "targeting", "strategy"],
      "zones": ["focus", "data"]
    },
    {
      "id": "jason-feifer-003",
      "speaker": "Jason Feifer",
      "text": "The editor, the writer, I'll just say it as plainly as possible, they don't care about you. They don't care about you. They care about their reader, or their listener, or their viewer. That's who they care about. That's who they're serving.",
      "timestamp": "00:14:44",
      "source": {
        "slug": "jason-feifer",
        "path": "episodes/jason-feifer/transcript.md",
        "lineStart": 148,
        "lineEnd": 148
      },
      "themes": ["empathy", "audience", "mindset"],
      "zones": ["discovery", "intuition"]
    },
    {
      "id": "jason-feifer-004",
      "speaker": "Jason Feifer",
      "text": "The way that I think of Entrepreneur is that it's not even a magazine about business. It's a magazine about thinking. What I want to do is make sure that everybody who comes to the magazine walks away with great insights into how to think through the challenges in their business.",
      "timestamp": "00:16:50",
      "source": {
        "slug": "jason-feifer",
        "path": "episodes/jason-feifer/transcript.md",
        "lineStart": 160,
        "lineEnd": 160
      },
      "themes": ["mission", "product-thinking", "audience"],
      "zones": ["discovery", "intuition"]
    },
    {
      "id": "jason-feifer-005",
      "speaker": "Jason Feifer",
      "text": "Stories in Entrepreneur are not really about the person that I'm writing about. They're really about the audience. They're really me serving the audience through the stories of the people I'm writing about.",
      "timestamp": "00:25:23",
      "source": {
        "slug": "jason-feifer",
        "path": "episodes/jason-feifer/transcript.md",
        "lineStart": 203,
        "lineEnd": 203
      },
      "themes": ["audience-first", "storytelling", "empathy"],
      "zones": ["alignment", "discovery"]
    },
    {
      "id": "jason-feifer-006",
      "speaker": "Jason Feifer",
      "text": "The most important thing that a PR person can have is active relationships with people in media. If a PR person is guaranteeing you press, that's another reason to run out the door as fast as possible because PR people cannot control this. Writers and editors, they do what they want. It's a completely subjective industry.",
      "timestamp": "00:32:08",
      "source": {
        "slug": "jason-feifer",
        "path": "episodes/jason-feifer/transcript.md",
        "lineStart": 259,
        "lineEnd": 259
      },
      "themes": ["relationships", "trust", "authenticity"],
      "zones": ["alignment", "chaos"]
    },
    {
      "id": "jason-feifer-007",
      "speaker": "Jason Feifer",
      "text": "Sometimes what you're looking for is a prize to walk around with. Why get the funding announcement in TechCrunch? Probably not because anyone's going to care because they read it on TechCrunch, but now you can use that to your own means. And sometimes that's more valuable than the press itself.",
      "timestamp": "00:41:52",
      "source": {
        "slug": "jason-feifer",
        "path": "episodes/jason-feifer/transcript.md",
        "lineStart": 310,
        "lineEnd": 310
      },
      "themes": ["positioning", "social-proof", "strategy"],
      "zones": ["intuition", "velocity"]
    },
    {
      "id": "jason-feifer-008",
      "speaker": "Jason Feifer",
      "text": "Success stories are not interesting. They're not interesting to anybody. It's not useful for you to just hear that someone else succeeded. What's useful is for you to hear how someone else faced challenges that you faced and got through them so that you can see, aha, that's an interesting strategy to use for me.",
      "timestamp": "01:04:42",
      "source": {
        "slug": "jason-feifer",
        "path": "episodes/jason-feifer/transcript.md",
        "lineStart": 547,
        "lineEnd": 547
      },
      "themes": ["storytelling", "vulnerability", "learning"],
      "zones": ["discovery", "chaos"]
    },
    {
      "id": "jason-feifer-009",
      "speaker": "Jason Feifer",
      "text": "Be human, be human. Press releases don't work because they're not human. I don't like interviewing people who are on talking points because that's not human. You're ultimately engaging in a human business. A subjective decision is being made about how to serve an audience of humans.",
      "timestamp": "01:27:23",
      "source": {
        "slug": "jason-feifer",
        "path": "episodes/jason-feifer/transcript.md",
        "lineStart": 769,
        "lineEnd": 769
      },
      "themes": ["authenticity", "communication", "human-connection"],
      "zones": ["intuition", "chaos"]
    },
    {
      "id": "jason-feifer-010",
      "speaker": "Jason Feifer",
      "text": "Sometimes you are not the story, but you can be part of the story. Sometimes that means reaching out and telling me about this really interesting thing that's happening in your space and the role that you happen to play in it. Now I think, oh, well that's interesting. Maybe there's a story about that.",
      "timestamp": "01:23:46",
      "source": {
        "slug": "jason-feifer",
        "path": "episodes/jason-feifer/transcript.md",
        "lineStart": 737,
        "lineEnd": 737
      },
      "themes": ["positioning", "creativity", "narrative"],
      "zones": ["discovery", "intuition"]
    },
    {
      "id": "jason-feifer-011",
      "speaker": "Jason Feifer",
      "text": "In front of you right now there are two sets of opportunities. Opportunity set A is everything that's asked of you. Then there's opportunity set B which is what's available to you, even though nobody's asking you to do it. What I have found throughout my own career is that opportunity set B is always more important, infinitely more important.",
      "timestamp": "01:37:02",
      "source": {
        "slug": "jason-feifer",
        "path": "episodes/jason-feifer/transcript.md",
        "lineStart": 922,
        "lineEnd": 922
      },
      "themes": ["growth", "career", "initiative"],
      "zones": ["chaos", "discovery", "velocity"]
    },
    {
      "id": "jason-feifer-012",
      "speaker": "Jason Feifer",
      "text": "What's the point of building something if you can't maintain it? I love that question because I, like probably everyone listening to this, pushes themselves really hard, and at some point you have to step back and think, am I building something where at some point there is sustainability for me here?",
      "timestamp": "01:34:10",
      "source": {
        "slug": "jason-feifer",
        "path": "episodes/jason-feifer/transcript.md",
        "lineStart": 868,
        "lineEnd": 868
      },
      "themes": ["sustainability", "self-awareness", "balance"],
      "zones": ["focus", "perfection"]
    }
  ],
  "themes": ["press-strategy", "audience-empathy", "storytelling", "authenticity", "positioning", "relationships", "career-growth", "sustainability"],
  "takeaways": [
    "Treat press like fundraising: only pursue it when you have a clear tactical goal for what the coverage will accomplish, whether that's driving awareness, attracting investors, or positioning your brand.",
    "Understand the publication's mission before pitching: editors and writers serve their audience, not you. Study what they publish and frame your story to fit their editorial purpose, not your press release.",
    "Freelance writers are often your best path in: they're hungrier for stories, more responsive to cold outreach, and receive far fewer pitches than staff editors at major publications.",
    "Sometimes the real value of press is the social proof, not the readership: an 'as seen in' badge, a link in pitch decks, or a promoted tweet of your coverage can outperform the article's direct traffic.",
    "Pursue Opportunity Set B: the most career-defining moves come from what's available to you but nobody asks you to do, not from excelling at what's already expected."
  ],
  "zone_influence": {
    "velocity": 0.08,
    "perfection": 0.08,
    "discovery": 0.22,
    "data": 0.08,
    "intuition": 0.22,
    "alignment": 0.12,
    "chaos": 0.12,
    "focus": 0.08
  },
  "contrarian_candidates": [
    {
      "quoteId": "jason-feifer-008",
      "why": "Success stories are not interesting to anybody - directly challenges the common instinct to lead with achievements when pitching press",
      "related_zones": ["discovery", "chaos"]
    },
    {
      "quoteId": "jason-feifer-011",
      "why": "Opportunity Set B is infinitely more important than what's asked of you - argues that the things nobody expects you to do matter more than excelling at your job description",
      "related_zones": ["chaos", "discovery"]
    },
    {
      "quoteId": "jason-feifer-007",
      "why": "Sometimes the press itself matters less than the trophy of having gotten it - reframes the entire value proposition of media coverage",
      "related_zones": ["intuition", "velocity"]
    }
  ],
  "guest_metadata": {
    "guest_type": "media-executive",
    "company_stage": "established",
    "primary_topics": ["press-strategy", "media-relations", "storytelling", "career-growth"]
  }
}