{
  "slug": "jerry-colonna",
  "quotes": [
    {
      "id": "jerry-colonna-001",
      "speaker": "Jerry Colonna",
      "text": "Part of my approach not only to coaching, but to the process of growing up, is to use what I call radical self-inquiry, to really cut through our own delusions and say, how does it serve me to feel completely busy to the point where I feel exhausted? And perhaps there's another more conscious way of getting that feeling than feeling like crap all the time.",
      "timestamp": "00:05:56",
      "source": {
        "slug": "jerry-colonna",
        "path": "episodes/jerry-colonna/transcript.md",
        "lineStart": 79,
        "lineEnd": 79
      },
      "themes": ["self-awareness", "coaching", "busyness"],
      "zones": ["discovery", "intuition"]
    },
    {
      "id": "jerry-colonna-002",
      "speaker": "Jerry Colonna",
      "text": "The equation is practical skills plus radical self-inquiry plus shared experiences, that is the process of actually talking about the craziness that goes on in your head equals greater leadership. I get you want to be a great CEO, I get you want to be a great executive, but what I really care about is you not killing yourself in the process.",
      "timestamp": "00:09:05",
      "source": {
        "slug": "jerry-colonna",
        "path": "episodes/jerry-colonna/transcript.md",
        "lineStart": 91,
        "lineEnd": 94
      },
      "themes": ["leadership", "resilience", "mental-health"],
      "zones": ["alignment", "chaos"]
    },
    {
      "id": "jerry-colonna-003",
      "speaker": "Jerry Colonna",
      "text": "Part of what makes radical self-inquiry radical is we're socialized not to ask certain kinds of questions. Someone says it's really important for me to be ambitious and achieve a particular goal. What's radical is to ask, and what will that do for you? What is it that you believe being successful will do for you? How do you define success? Where does that come from?",
      "timestamp": "00:12:34",
      "source": {
        "slug": "jerry-colonna",
        "path": "episodes/jerry-colonna/transcript.md",
        "lineStart": 109,
        "lineEnd": 109
      },
      "themes": ["self-inquiry", "ambition", "consciousness"],
      "zones": ["discovery", "intuition"]
    },
    {
      "id": "jerry-colonna-004",
      "speaker": "Jerry Colonna",
      "text": "What I encourage people to do is to ask themselves these kinds of questions so that they can raise their level of consciousness so that they can be in the driver's seat of their lives and not some learned behavior that they developed as a child to answer perhaps their parents or grandparents' anxieties.",
      "timestamp": "00:15:02",
      "source": {
        "slug": "jerry-colonna",
        "path": "episodes/jerry-colonna/transcript.md",
        "lineStart": 115,
        "lineEnd": 115
      },
      "themes": ["self-awareness", "agency", "growth"],
      "zones": ["discovery", "intuition", "chaos"]
    },
    {
      "id": "jerry-colonna-005",
      "speaker": "Jerry Colonna",
      "text": "We have this belief system that if I pay no attention to the thing that I'm afraid of, it's somehow going to magically go away. And that's not actually how life works. More often than not, what we do is we respond to the source of challenge by plastering over band-aids and sometimes they're relatively healthy, we become obsessed with working out, or sometimes they're unhealthy.",
      "timestamp": "00:18:25",
      "source": {
        "slug": "jerry-colonna",
        "path": "episodes/jerry-colonna/transcript.md",
        "lineStart": 136,
        "lineEnd": 136
      },
      "themes": ["avoidance", "coping", "self-delusion"],
      "zones": ["chaos", "discovery"]
    },
    {
      "id": "jerry-colonna-006",
      "speaker": "Jerry Colonna",
      "text": "You know you're in the radical self-inquiry zone when the questions take your breath away. The most important person with whom you should share the answers is oneself. Self-delusion along with attachment are the biggest contributors to our own suffering. Everything's great. How you doing? Everything's great. Bullshit. Can we just not bullshit each other?",
      "timestamp": "00:25:27",
      "source": {
        "slug": "jerry-colonna",
        "path": "episodes/jerry-colonna/transcript.md",
        "lineStart": 163,
        "lineEnd": 163
      },
      "themes": ["self-delusion", "honesty", "radical-self-inquiry"],
      "zones": ["discovery", "alignment"]
    },
    {
      "id": "jerry-colonna-007",
      "speaker": "Jerry Colonna",
      "text": "We, too often than not, especially in the entrepreneurial community are socialized to bullshit not only ourselves, but everybody else. All our companies are moving up into the right, every product is working, we don't really have any problems because we're crushing it, and that's just a lie. Imagine having the capacity to be in relationship with people where you can just tell the truth.",
      "timestamp": "00:27:57",
      "source": {
        "slug": "jerry-colonna",
        "path": "episodes/jerry-colonna/transcript.md",
        "lineStart": 175,
        "lineEnd": 175
      },
      "themes": ["honesty", "startup-culture", "vulnerability"],
      "zones": ["alignment", "chaos"]
    },
    {
      "id": "jerry-colonna-008",
      "speaker": "Jerry Colonna",
      "text": "What if you could enjoy the puzzle of trying to create something new, trying to create magic, something out of nothing, but it doesn't matter to your sense of self-esteem if you succeed or fail. What if what drove you was not quieting that voice, but what drove you was, oh, this is just fun?",
      "timestamp": "00:32:52",
      "source": {
        "slug": "jerry-colonna",
        "path": "episodes/jerry-colonna/transcript.md",
        "lineStart": 232,
        "lineEnd": 232
      },
      "themes": ["motivation", "detachment", "creativity"],
      "zones": ["intuition", "chaos"]
    },
    {
      "id": "jerry-colonna-009",
      "speaker": "Jerry Colonna",
      "text": "When we become attached to the outcome, we inadvertently fuel our own suffering. Really the deeper attachment is see, I'm not nothing. See, I'm not a nobody, I'm a somebody, and that's the source of the suffering.",
      "timestamp": "00:35:11",
      "source": {
        "slug": "jerry-colonna",
        "path": "episodes/jerry-colonna/transcript.md",
        "lineStart": 274,
        "lineEnd": 274
      },
      "themes": ["attachment", "identity", "suffering"],
      "zones": ["intuition", "focus"]
    },
    {
      "id": "jerry-colonna-010",
      "speaker": "Jerry Colonna",
      "text": "The minute you start to nail it down to the floor and say this is the way it ought to be, I ought to always have a growth mindset, you've become fixed. And that's what the ego does. Stay attached to the growth and hold mindset a little loosely.",
      "timestamp": "01:05:18",
      "source": {
        "slug": "jerry-colonna",
        "path": "episodes/jerry-colonna/transcript.md",
        "lineStart": 445,
        "lineEnd": 448
      },
      "themes": ["growth-mindset", "adaptability", "ego"],
      "zones": ["chaos", "intuition"]
    },
    {
      "id": "jerry-colonna-011",
      "speaker": "Jerry Colonna",
      "text": "Until you make conscious the unconscious patterns operating in the group, the group will continue to repeat those patterns and you will blame somebody in the group. If you want to create a high-functioning team, do your work, and it starts with the person who has the most power in the group.",
      "timestamp": "01:13:35",
      "source": {
        "slug": "jerry-colonna",
        "path": "episodes/jerry-colonna/transcript.md",
        "lineStart": 481,
        "lineEnd": 481
      },
      "themes": ["team-dynamics", "leadership", "self-awareness"],
      "zones": ["alignment", "discovery"]
    }
  ],
  "themes": ["radical-self-inquiry", "leadership", "coaching", "self-awareness", "attachment", "resilience", "team-dynamics", "honesty", "growth-mindset", "mental-health"],
  "takeaways": [
    "Practical skills plus radical self-inquiry plus shared experiences is the equation for enhanced leadership and greater resilience - asking yourself hard questions is not optional for leaders, it is the core work.",
    "The question 'How have I been complicit in creating the conditions I say I don't want?' is not about blame - it is about reclaiming your own agency by seeing how you unconsciously participate in patterns you claim to oppose.",
    "Teams fail not because of lack of talent, strategy, or execution, but because of the unresolved personal baggage of their leaders - the person with the most power must do their inner work first or the entire group suffers.",
    "Attachment to outcomes is the root of entrepreneurial suffering - detaching your self-worth from business success and approaching work as an art project leads to both better results and less anxiety.",
    "Growth mindset becomes a trap when held too tightly - the ego turns a useful orientation into a rigid identity, and true growth requires holding your mindset loosely enough to adapt when the world changes."
  ],
  "zone_influence": {
    "velocity": 0.00,
    "perfection": 0.00,
    "discovery": 0.25,
    "data": 0.00,
    "intuition": 0.20,
    "alignment": 0.20,
    "chaos": 0.20,
    "focus": 0.15
  },
  "contrarian_candidates": [
    {
      "quoteId": "jerry-colonna-007",
      "why": "Directly challenges startup culture's obsession with projecting success - calls the entrepreneurial norm of 'crushing it' a lie and demands radical honesty instead",
      "related_zones": ["alignment", "chaos"]
    },
    {
      "quoteId": "jerry-colonna-010",
      "why": "Turns growth mindset on its head - argues that rigidly holding a growth mindset is itself a fixed mindset, a contrarian take in a community that worships growth",
      "related_zones": ["chaos", "intuition"]
    },
    {
      "quoteId": "jerry-colonna-008",
      "why": "Challenges the assumption that fear of failure is a useful motivator - proposes detaching self-esteem from outcomes entirely, counter to hustle culture",
      "related_zones": ["intuition", "chaos"]
    }
  ],
  "guest_metadata": {
    "guest_type": "coach",
    "company_stage": "growth",
    "primary_topics": ["radical-self-inquiry", "executive-coaching", "leadership-resilience", "team-dynamics"]
  }
}
