{
  "slug": "lauren-ipsen",
  "quotes": [
    {
      "id": "lauren-ipsen-q001",
      "speaker": "Lauren Ipsen",
      "text": "Regardless of whether or not you're hiring, you should always be keeping a pulse on the market. That is the most important thing. You never want to put yourself in a position where you have no idea what good looks like, whether that's from a company standpoint or from a candidate standpoint.",
      "timestamp": "00:22:07",
      "source": {
        "slug": "lauren-ipsen",
        "path": "episodes/lauren-ipsen/transcript.md",
        "lineStart": 226,
        "lineEnd": 226
      },
      "themes": ["hiring", "talent-market", "leadership"],
      "zones": ["discovery", "alignment"]
    },
    {
      "id": "lauren-ipsen-q002",
      "speaker": "Lauren Ipsen",
      "text": "It's really easy to be distracted by shiny objects and look at huge names. You want to find the CPOs of Google and YouTube because that seems incredible for brand recognition. But the fact of the matter is, oftentimes those individuals are pretty far from the work and have a great team of executors that are actually in the weeds.",
      "timestamp": "00:09:59",
      "source": {
        "slug": "lauren-ipsen",
        "path": "episodes/lauren-ipsen/transcript.md",
        "lineStart": 130,
        "lineEnd": 130
      },
      "themes": ["hiring", "leadership", "product-management"],
      "zones": ["focus", "intuition"]
    },
    {
      "id": "lauren-ipsen-q003",
      "speaker": "Lauren Ipsen",
      "text": "Who is going to be best for this specific role at this specific time, not necessarily who is the best talent in the world or in the market. Those are two very, very different questions to ask.",
      "timestamp": "00:12:46",
      "source": {
        "slug": "lauren-ipsen",
        "path": "episodes/lauren-ipsen/transcript.md",
        "lineStart": 148,
        "lineEnd": 148
      },
      "themes": ["hiring", "strategy", "decision-making"],
      "zones": ["focus", "alignment"]
    },
    {
      "id": "lauren-ipsen-q004",
      "speaker": "Lauren Ipsen",
      "text": "What is the actual outcome that we are trying to solve for with this hire? Or are we just hiring a head of product because we feel like we need to hire a head of product? Whenever you're starting a search in that regard, it's kind of doomed from inception.",
      "timestamp": "00:14:12",
      "source": {
        "slug": "lauren-ipsen",
        "path": "episodes/lauren-ipsen/transcript.md",
        "lineStart": 157,
        "lineEnd": 157
      },
      "themes": ["hiring", "product-management", "strategy"],
      "zones": ["focus", "alignment"]
    },
    {
      "id": "lauren-ipsen-q005",
      "speaker": "Lauren Ipsen",
      "text": "I encourage founders to simply chat with what good looks like and get a really good sense of what benchmark candidate profiles could be. Staying really, really close to really great people and using them from an advising capacity or getting them ingrained in some type of involvement in the product prior to actually having that specific need is really important.",
      "timestamp": "00:22:43",
      "source": {
        "slug": "lauren-ipsen",
        "path": "episodes/lauren-ipsen/transcript.md",
        "lineStart": 229,
        "lineEnd": 229
      },
      "themes": ["hiring", "networking", "founder-advice"],
      "zones": ["discovery", "alignment"]
    },
    {
      "id": "lauren-ipsen-q006",
      "speaker": "Lauren Ipsen",
      "text": "The VP of engineering candidate that we ultimately landed, it was a seven month game of courtship. Let's bring him in to help out from an advising capacity, let's ask him how he would think about structuring this organization. The founder and that leader will build a different level of rapport and trust by not going through a formal interview process.",
      "timestamp": "00:24:41",
      "source": {
        "slug": "lauren-ipsen",
        "path": "episodes/lauren-ipsen/transcript.md",
        "lineStart": 250,
        "lineEnd": 250
      },
      "themes": ["hiring", "relationship-building", "recruiting"],
      "zones": ["alignment", "focus"]
    },
    {
      "id": "lauren-ipsen-q007",
      "speaker": "Lauren Ipsen",
      "text": "Some of the greatest talent, they're not even on LinkedIn. So I think it's building a really strong network in advance, and then once you actually get to a place where you need to hire that person, calling all of those amazing people and saying, 'Now tell me who your favorite person is and who the best person you've ever worked with is.'",
      "timestamp": "00:28:05",
      "source": {
        "slug": "lauren-ipsen",
        "path": "episodes/lauren-ipsen/transcript.md",
        "lineStart": 280,
        "lineEnd": 283
      },
      "themes": ["hiring", "networking", "recruiting"],
      "zones": ["discovery", "intuition"]
    },
    {
      "id": "lauren-ipsen-q008",
      "speaker": "Lauren Ipsen",
      "text": "Just because someone has a brand on their resume at the right time, I think oftentimes CEOs and founders will over generalize. There's going to be people that are breakout, top 1% type individuals, and then other individuals that get to ride the wave and reap the benefits of being at the right place at the right time.",
      "timestamp": "00:32:19",
      "source": {
        "slug": "lauren-ipsen",
        "path": "episodes/lauren-ipsen/transcript.md",
        "lineStart": 313,
        "lineEnd": 313
      },
      "themes": ["hiring", "evaluation", "bias"],
      "zones": ["intuition", "data"]
    },
    {
      "id": "lauren-ipsen-q009",
      "speaker": "Lauren Ipsen",
      "text": "We're always looking to see where people moved the needle, especially on the product side, where their fingerprints were, what they can actually point to that they did and are proud of during their time there. And if all that they can say is that they onboarded and moved on, then it's not going to be something that I can stand on to cheer you on.",
      "timestamp": "00:42:55",
      "source": {
        "slug": "lauren-ipsen",
        "path": "episodes/lauren-ipsen/transcript.md",
        "lineStart": 400,
        "lineEnd": 400
      },
      "themes": ["career-growth", "impact", "hiring"],
      "zones": ["focus", "velocity"]
    },
    {
      "id": "lauren-ipsen-q010",
      "speaker": "Lauren Ipsen",
      "text": "If I call 10 people that were a part of the same organization as someone during a given period of time and they can't speak to anything they did, in that case, no news is not necessarily good news. You want to have an impact, you want to be able to say, 'I did X, Y and Z. I'm super proud of this and the reason I moved on is because I did what I came in to accomplish.'",
      "timestamp": "00:44:20",
      "source": {
        "slug": "lauren-ipsen",
        "path": "episodes/lauren-ipsen/transcript.md",
        "lineStart": 412,
        "lineEnd": 412
      },
      "themes": ["hiring", "impact", "references", "career-growth"],
      "zones": ["data", "focus"]
    },
    {
      "id": "lauren-ipsen-q011",
      "speaker": "Lauren Ipsen",
      "text": "Back channel references will always provide a greater source of truth than provided. It's similar to an Instagram Reel as opposed to the photos you're tagged in. This is what you want the world to see or think of you as, and then these are what your peers and your direct reports actually say about the work that you did.",
      "timestamp": "00:49:04",
      "source": {
        "slug": "lauren-ipsen",
        "path": "episodes/lauren-ipsen/transcript.md",
        "lineStart": 451,
        "lineEnd": 451
      },
      "themes": ["hiring", "references", "evaluation"],
      "zones": ["data", "intuition"]
    }
  ],
  "themes": ["hiring", "recruiting", "leadership", "career-growth", "networking", "talent-evaluation", "references", "product-management", "founder-advice"],
  "takeaways": [
    "Don't chase shiny executive names - the best hire for your stage is often a lieutenant one level down who is still close to the work and hungry to prove themselves.",
    "Always keep a pulse on the talent market even when you're not hiring - build relationships with great people so when you need to hire, you're not starting from scratch.",
    "Back channel references are the Instagram tagged photos versus the curated Reel - always go beyond provided references to understand who someone really is.",
    "Logo collecting on a resume is a red flag, but so is staying too long at a declining company out of loyalty - the key is demonstrable impact wherever you've been.",
    "Define the specific outcome you need before writing the job description - hiring a 'head of product' without knowing what they'll actually do is doomed from inception."
  ],
  "zone_influence": {
    "velocity": 0.05,
    "perfection": 0.05,
    "discovery": 0.20,
    "data": 0.15,
    "intuition": 0.20,
    "alignment": 0.20,
    "chaos": 0.00,
    "focus": 0.15
  },
  "contrarian_candidates": [
    {
      "quoteId": "lauren-ipsen-q002",
      "why": "Senior executives from famous companies are often the wrong hire for startups - they're far from the work and their teams did the real execution",
      "related_zones": ["focus", "intuition"]
    },
    {
      "quoteId": "lauren-ipsen-q008",
      "why": "Having a top company's logo on your resume doesn't mean you were a top performer - many people ride the wave of being at the right place at the right time",
      "related_zones": ["intuition", "data"]
    }
  ],
  "guest_metadata": {
    "guest_type": "advisor",
    "company_stage": "mixed",
    "primary_topics": ["hiring", "recruiting", "talent-evaluation", "career-growth", "leadership"]
  }
}