{
  "slug": "phyl-terry",
  "quotes": [
    {
      "id": "phyl-terry-001",
      "speaker": "Phyl Terry",
      "text": "The most important thing to manage is your emotional balance. I talk about your emotional balance sheet. And for many job seekers, they have more liabilities than assets on their old balance sheets. They have more fear and anxiety, they feel demoralized, they have a hard time going.",
      "timestamp": "00:13:46",
      "source": {
        "slug": "phyl-terry",
        "path": "episodes/phyl-terry/transcript.md",
        "lineStart": 175,
        "lineEnd": 175
      },
      "themes": ["emotional-intelligence", "job-search", "self-awareness"],
      "zones": ["chaos", "alignment"]
    },
    {
      "id": "phyl-terry-002",
      "speaker": "Phyl Terry",
      "text": "Creative destruction basically says, under capitalism, it's dynamic. New products and services displace or disrupt old products and services, companies and methods. It's why our economy has grown sixfold over the last a hundred years. But it comes with some negative unintended consequences, which is that people both in jobs and out of jobs, they're anxious and fearful. There's no program that addresses that.",
      "timestamp": "00:18:18",
      "source": {
        "slug": "phyl-terry",
        "path": "episodes/phyl-terry/transcript.md",
        "lineStart": 205,
        "lineEnd": 205
      },
      "themes": ["creative-destruction", "capitalism", "career-resilience"],
      "zones": ["chaos", "discovery"]
    },
    {
      "id": "phyl-terry-003",
      "speaker": "Phyl Terry",
      "text": "Most people don't do that. When they get laid off, they spray and pray. I'm like, 'I'm going to slow you down to go fast.' In fact, what our data shows is that the average job search in the Job Search Council from beginning to end is three months. If you look at the national data for job search, it's three to six months.",
      "timestamp": "00:21:59",
      "source": {
        "slug": "phyl-terry",
        "path": "episodes/phyl-terry/transcript.md",
        "lineStart": 220,
        "lineEnd": 220
      },
      "themes": ["strategy", "candidate-market-fit", "focus"],
      "zones": ["focus", "discovery"]
    },
    {
      "id": "phyl-terry-004",
      "speaker": "Phyl Terry",
      "text": "The secret about the listening tour is that not only are you getting market research customer feedback on your fit, you're also creating a whole group of listening posts, people who are invested in your success.",
      "timestamp": "00:25:43",
      "source": {
        "slug": "phyl-terry",
        "path": "episodes/phyl-terry/transcript.md",
        "lineStart": 241,
        "lineEnd": 241
      },
      "themes": ["networking", "user-research", "listening-tour"],
      "zones": ["discovery", "alignment"]
    },
    {
      "id": "phyl-terry-005",
      "speaker": "Phyl Terry",
      "text": "When you're looking for a job, you need a spear and not a net. With a net, everything slips through. We need a narrow, clear focus. Same thing with candidate market fit.",
      "timestamp": "00:31:02",
      "source": {
        "slug": "phyl-terry",
        "path": "episodes/phyl-terry/transcript.md",
        "lineStart": 286,
        "lineEnd": 286
      },
      "themes": ["candidate-market-fit", "focus", "product-market-fit"],
      "zones": ["focus", "discovery"]
    },
    {
      "id": "phyl-terry-006",
      "speaker": "Phyl Terry",
      "text": "People are expansive, but not reductive. If I told you, 'Hey, Lenny, I'll take any product job I can,' you are never going to think of me. You're never going to remember me. You're not going to be reductive from a broad statement, but you will be expansive from a narrow.",
      "timestamp": "00:32:08",
      "source": {
        "slug": "phyl-terry",
        "path": "episodes/phyl-terry/transcript.md",
        "lineStart": 289,
        "lineEnd": 289
      },
      "themes": ["positioning", "candidate-market-fit", "product-thinking"],
      "zones": ["focus", "intuition"]
    },
    {
      "id": "phyl-terry-007",
      "speaker": "Phyl Terry",
      "text": "The closer you are to the technology frontier, the more new jobs and opportunities there are. The further you are from the technology frontier, the worse you're going to be over the long run. You might be able to get a better-sounding job in the short term, but you're going to find yourself stuck.",
      "timestamp": "00:41:46",
      "source": {
        "slug": "phyl-terry",
        "path": "episodes/phyl-terry/transcript.md",
        "lineStart": 367,
        "lineEnd": 367
      },
      "themes": ["career-growth", "technology", "creative-destruction"],
      "zones": ["velocity", "chaos"]
    },
    {
      "id": "phyl-terry-008",
      "speaker": "Phyl Terry",
      "text": "When you start interviewing, I want you to create your own version of the job description. I want you to create what I call a job mission with OKRs. Most job descriptions, they suck. The company doesn't know what they're looking for. I want you to create something where you are saying, 'Here's what I think I'm going to be accountable for. Here's the outcomes I'm going to deliver.'",
      "timestamp": "00:49:49",
      "source": {
        "slug": "phyl-terry",
        "path": "episodes/phyl-terry/transcript.md",
        "lineStart": 433,
        "lineEnd": 436
      },
      "themes": ["interviewing", "okrs", "initiative"],
      "zones": ["velocity", "data", "focus"]
    },
    {
      "id": "phyl-terry-009",
      "speaker": "Phyl Terry",
      "text": "By doing the job mission of the OKRs, and by showing them that draft, you are showing them. Not telling them, showing them that you take initiative, that you're accountable, that you can make things happen. 87% of the time, when you ask for more money, you get it. People are afraid to ask.",
      "timestamp": "00:59:50",
      "source": {
        "slug": "phyl-terry",
        "path": "episodes/phyl-terry/transcript.md",
        "lineStart": 499,
        "lineEnd": 499
      },
      "themes": ["negotiation", "initiative", "salary"],
      "zones": ["data", "velocity"]
    },
    {
      "id": "phyl-terry-010",
      "speaker": "Phyl Terry",
      "text": "Asking for help is not a sign of weakness, it's a sign of confidence. It both requires confidence and strengthens it. It's not a taking activity, it's a giving activity. If you do it well, you're actually being giving to the people you ask.",
      "timestamp": "01:14:48",
      "source": {
        "slug": "phyl-terry",
        "path": "episodes/phyl-terry/transcript.md",
        "lineStart": 637,
        "lineEnd": 637
      },
      "themes": ["asking-for-help", "vulnerability", "leadership"],
      "zones": ["alignment", "intuition"]
    },
    {
      "id": "phyl-terry-011",
      "speaker": "Phyl Terry",
      "text": "85% of the people who get to a senior role credit asking for help to help get them there. 85% of the people in a junior role say they're afraid to ask for help because they think it's a sign of weakness.",
      "timestamp": "01:18:33",
      "source": {
        "slug": "phyl-terry",
        "path": "episodes/phyl-terry/transcript.md",
        "lineStart": 667,
        "lineEnd": 667
      },
      "themes": ["asking-for-help", "career-growth", "data-insight"],
      "zones": ["data", "alignment"]
    }
  ],
  "themes": ["candidate-market-fit", "asking-for-help", "job-search-strategy", "emotional-resilience", "community", "negotiation", "creative-destruction", "career-growth"],
  "takeaways": [
    "Candidate market fit is the most important job search concept -- just like product-market fit, you need a narrow, specific statement of what role you're seeking rather than a broad net, because people will be expansive from a narrow pitch but never reductive from a vague one.",
    "The most important thing to manage during a job search is your emotional balance sheet, not your resume or LinkedIn -- fear and anxiety erode interview performance and lead to worse outcomes, which is why doing it in community through a Job Search Council is transformative.",
    "Before negotiating salary, create a job mission with OKRs that shows the hiring manager you already understand what success looks like -- this distinguishes you from good talkers and dramatically increases your odds of getting the offer and better compensation.",
    "Asking for help is not weakness but confidence -- 85% of senior leaders credit asking for help with their career advancement, yet 85% of junior people are afraid to do it, creating a paradox that holds careers back.",
    "Stay close to the technology frontier because that's where new jobs and opportunities are created through creative destruction -- taking a lower title at a frontier company often beats a senior title at a stagnant one."
  ],
  "zone_influence": {
    "velocity": 0.10,
    "perfection": 0.00,
    "discovery": 0.20,
    "data": 0.15,
    "intuition": 0.10,
    "alignment": 0.20,
    "chaos": 0.10,
    "focus": 0.15
  },
  "contrarian_candidates": [
    {
      "quoteId": "phyl-terry-006",
      "why": "Counterintuitively argues that narrowing your job search to an extremely specific niche makes you more memorable and findable, not less -- the opposite of the spray-and-pray instinct most job seekers follow",
      "related_zones": ["focus", "intuition"]
    },
    {
      "quoteId": "phyl-terry-010",
      "why": "Reframes asking for help as a giving activity rather than a taking one, and as a sign of confidence rather than weakness -- directly challenges the rugged individualist mindset in tech",
      "related_zones": ["alignment", "intuition"]
    },
    {
      "quoteId": "phyl-terry-007",
      "why": "Argues you should take a lower-level IC role at a frontier company rather than a senior title at a lagging one -- goes against status-driven career thinking",
      "related_zones": ["velocity", "chaos"]
    }
  ],
  "guest_metadata": {
    "guest_type": "advisor",
    "company_stage": "established",
    "primary_topics": ["job-search-strategy", "candidate-market-fit", "asking-for-help", "negotiation", "community-building"]
  }
}