{
  "slug": "shreyas-doshi",
  "guest": "Shreyas Doshi",
  "episode_title": "The art of product management | Shreyas Doshi (Stripe, Twitter, Google, Yahoo)",
  "verification_date": "2026-01-22",
  "verified_by": "claude-agent",
  "quotes": [
    {
      "id": "shreyas-doshi-q001",
      "speaker": "Shreyas Doshi",
      "text": "If you do a pre-mortem right, you will not have to do an ugly post-mortem. The genius is the initial prompt: imagine this project has failed six months from now. Now work backwards and ask what went wrong. It creates psychological safety for team members to talk about things they're concerned about without being negative.",
      "timestamp": "00:25:47",
      "source": {
        "slug": "shreyas-doshi",
        "path": "episodes/shreyas-doshi/transcript.md",
        "lineStart": 180,
        "lineEnd": 183
      },
      "themes": [
        "pre-mortems",
        "risk-management",
        "psychological-safety",
        "frameworks"
      ],
      "zones": [
        "data",
        "perfection"
      ],
      "context": "Introducing the pre-mortem framework with tigers, paper tigers, and elephants",
      "verified": true
    },
    {
      "id": "shreyas-doshi-q002",
      "speaker": "Shreyas Doshi",
      "text": "In a pre-mortem, bring up three things: a tiger (a threat that will actually kill us), a paper tiger (a seeming threat others worry about but you're not), and an elephant in the room that nobody is talking about. That shared vocabulary becomes powerful - in future meetings people started saying 'I have this tiger' and it became okay to bring those things up.",
      "timestamp": "00:27:51",
      "source": {
        "slug": "shreyas-doshi",
        "path": "episodes/shreyas-doshi/transcript.md",
        "lineStart": 189,
        "lineEnd": 195
      },
      "themes": [
        "pre-mortems",
        "frameworks",
        "vocabulary",
        "risk-management"
      ],
      "zones": [
        "data",
        "discovery"
      ],
      "context": "Explaining the specific structure of effective pre-mortems",
      "verified": true
    },
    {
      "id": "shreyas-doshi-q003",
      "speaker": "Shreyas Doshi",
      "text": "All your tasks are not created equal. There are L tasks (leverage) where you put in effort and get 10X or 100X in return. N tasks (neutral) where you get what you put in. And O tasks (overhead) where you get back less than you put in. Most ambitious people treat each type the same way - and therein lies the problem.",
      "timestamp": "00:35:56",
      "source": {
        "slug": "shreyas-doshi",
        "path": "episodes/shreyas-doshi/transcript.md",
        "lineStart": 228,
        "lineEnd": 231
      },
      "themes": [
        "prioritization",
        "leverage",
        "time-management",
        "frameworks"
      ],
      "zones": [
        "focus",
        "data"
      ],
      "context": "Introducing the LNO framework for prioritizing PM time",
      "verified": true
    },
    {
      "id": "shreyas-doshi-q004",
      "speaker": "Shreyas Doshi",
      "text": "The same activity can be an L, N, or O task depending on context. Filing a bug report can be leverage if it's a critical issue requiring detailed documentation, or overhead if it's minor and you're just being thorough. Taking notes can be leverage after a strategic CEO decision, or overhead after a routine sync.",
      "timestamp": "00:38:43",
      "source": {
        "slug": "shreyas-doshi",
        "path": "episodes/shreyas-doshi/transcript.md",
        "lineStart": 237,
        "lineEnd": 243
      },
      "themes": [
        "prioritization",
        "context",
        "frameworks",
        "time-management"
      ],
      "zones": [
        "focus",
        "perfection"
      ],
      "context": "Illustrating how the same activity requires different levels of effort based on strategic importance",
      "verified": true
    },
    {
      "id": "shreyas-doshi-q005",
      "speaker": "Shreyas Doshi",
      "text": "Most execution problems that I encounter in high performing environments are actually not execution problems - they are either strategy problems or interpersonal problems or cultural problems. When you put on a bandaid and the bandaid falls off, it's probably not an execution issue.",
      "timestamp": "00:55:36",
      "source": {
        "slug": "shreyas-doshi",
        "path": "episodes/shreyas-doshi/transcript.md",
        "lineStart": 318,
        "lineEnd": 348
      },
      "themes": [
        "execution",
        "strategy",
        "root-cause",
        "problem-solving"
      ],
      "zones": [
        "discovery",
        "focus"
      ],
      "context": "Explaining why teams stay overwhelmed solving the same problems repeatedly",
      "verified": true
    },
    {
      "id": "shreyas-doshi-q006",
      "speaker": "Shreyas Doshi",
      "text": "Two teams misaligned? It looks like an execution problem. But often it's because we don't know what the strategy is. We craft OKRs based on what makes sense, but they're not aligned because we lack clear strategy and priorities. All the review meetings in the world won't fix a strategy problem.",
      "timestamp": "00:58:09",
      "source": {
        "slug": "shreyas-doshi",
        "path": "episodes/shreyas-doshi/transcript.md",
        "lineStart": 327,
        "lineEnd": 336
      },
      "themes": [
        "strategy",
        "alignment",
        "root-cause",
        "okrs"
      ],
      "zones": [
        "focus",
        "alignment"
      ],
      "context": "Illustrating how lack of strategy manifests as execution problems",
      "verified": true
    },
    {
      "id": "shreyas-doshi-q007",
      "speaker": "Shreyas Doshi",
      "text": "In high leverage roles, stop doing work that simply provides positive ROI. Start focusing on work that minimizes opportunity cost. The problem with ROI mindset is you decrease the denominator by working on quick wins and low-hanging fruit. You fill your plate with quick wins and miss the upside by not focusing on optimal things.",
      "timestamp": "01:03:48",
      "source": {
        "slug": "shreyas-doshi",
        "path": "episodes/shreyas-doshi/transcript.md",
        "lineStart": 354,
        "lineEnd": 360
      },
      "themes": [
        "opportunity-cost",
        "roi",
        "prioritization",
        "leverage"
      ],
      "zones": [
        "focus",
        "data"
      ],
      "context": "Explaining the opportunity cost framework learned from observing Patrick Collison at Stripe",
      "verified": true
    },
    {
      "id": "shreyas-doshi-q008",
      "speaker": "Shreyas Doshi",
      "text": "Opportunity cost is the value of the optimal option minus the value of the chosen option. When we reprogram ourselves to think in terms of opportunity cost, we're no longer thinking 'Is this a good use of my time?' Instead: 'Is this the best use of my time?' It's a subtle but profound shift.",
      "timestamp": "01:05:27",
      "source": {
        "slug": "shreyas-doshi",
        "path": "episodes/shreyas-doshi/transcript.md",
        "lineStart": 360,
        "lineEnd": 363
      },
      "themes": [
        "opportunity-cost",
        "decision-making",
        "prioritization",
        "mindset"
      ],
      "zones": [
        "focus",
        "perfection"
      ],
      "context": "Contrasting opportunity cost thinking with traditional ROI thinking",
      "verified": true
    },
    {
      "id": "shreyas-doshi-q009",
      "speaker": "Shreyas Doshi",
      "text": "I learned from Google's 70-20-10: during planning, give teams allocation guidance. 60% on incrementals (high ROI features), 30% on big new initiatives (can't be five initiatives, probably one or two), 10% on stability and infrastructure. This gives people space to pursue the right things instead of filling everything with quick wins.",
      "timestamp": "01:09:45",
      "source": {
        "slug": "shreyas-doshi",
        "path": "episodes/shreyas-doshi/transcript.md",
        "lineStart": 381,
        "lineEnd": 387
      },
      "themes": [
        "planning",
        "allocation",
        "portfolio",
        "google"
      ],
      "zones": [
        "focus",
        "data"
      ],
      "context": "Sharing tactical guidance on portfolio allocation to enable opportunity cost thinking",
      "verified": true
    },
    {
      "id": "shreyas-doshi-q010",
      "speaker": "Shreyas Doshi",
      "text": "High agency is finding a way to get what you want without waiting for conditions to be perfect or blaming circumstances. The PMs who surprised me in positive ways - exceeded their capabilities on paper - all had high agency: strong ownership, creative execution through challenges, and high resilience.",
      "timestamp": "01:12:55",
      "source": {
        "slug": "shreyas-doshi",
        "path": "episodes/shreyas-doshi/transcript.md",
        "lineStart": 392,
        "lineEnd": 399
      },
      "themes": [
        "agency",
        "ownership",
        "resilience",
        "execution"
      ],
      "zones": [
        "chaos",
        "focus"
      ],
      "context": "Describing the trait that differentiates high-impact PMs from those with unrealized potential",
      "verified": true
    },
    {
      "id": "shreyas-doshi-q011",
      "speaker": "Shreyas Doshi",
      "text": "At Google I learned the power of thinking really big. There was this unwritten rule: if it's not going to generate more than $100 million in revenue, it's not worth talking about. They would regularly not pursue $100 million opportunities because they had access to billion dollar ones. That habit to ask 'can we make it 10X bigger?' got ingrained.",
      "timestamp": "00:15:18",
      "source": {
        "slug": "shreyas-doshi",
        "path": "episodes/shreyas-doshi/transcript.md",
        "lineStart": 132,
        "lineEnd": 141
      },
      "themes": [
        "thinking-big",
        "ambition",
        "google",
        "scale"
      ],
      "zones": [
        "focus",
        "velocity"
      ],
      "context": "Describing Google's culture of thinking big and pursuing only massive opportunities",
      "verified": true
    },
    {
      "id": "shreyas-doshi-q012",
      "speaker": "Shreyas Doshi",
      "text": "Jack Dorsey would just listen a lot more than you'd expect the CEO to listen. Then he would ask one vital question. We discussed a potential acquisition - went through all the intellectual arguments, strategic arguments, metrics arguments. Jack asked: 'How does this make our users love Twitter more?' Simple question. We never really talked about that. I didn't have a good answer.",
      "timestamp": "00:19:42",
      "source": {
        "slug": "shreyas-doshi",
        "path": "episodes/shreyas-doshi/transcript.md",
        "lineStart": 153,
        "lineEnd": 162
      },
      "themes": [
        "leadership",
        "questions",
        "user-love",
        "twitter"
      ],
      "zones": [
        "discovery",
        "focus"
      ],
      "context": "Describing Jack Dorsey's leadership style and ability to ask penetrating questions",
      "verified": true
    }
  ],
  "themes": [
    "pre-mortems",
    "risk-management",
    "psychological-safety",
    "frameworks",
    "vocabulary",
    "prioritization",
    "leverage",
    "time-management",
    "context",
    "execution",
    "strategy",
    "root-cause",
    "problem-solving",
    "alignment",
    "okrs",
    "opportunity-cost",
    "roi",
    "decision-making",
    "mindset",
    "planning",
    "allocation",
    "portfolio",
    "google",
    "agency",
    "ownership",
    "resilience",
    "thinking-big",
    "ambition",
    "scale",
    "leadership",
    "questions",
    "user-love",
    "twitter"
  ],
  "takeaways": [
    "Run pre-mortems with tigers, paper tigers, and elephants - imagine the project failed six months from now and work backwards to identify threats, creating psychological safety to discuss concerns without being 'negative'",
    "Use the LNO framework to prioritize time - identify which tasks are Leverage (10-100X return), Neutral (1X return), or Overhead (<1X return), and treat them differently instead of applying equal effort to everything",
    "Most execution problems are actually strategy or culture problems - when the same issues keep recurring despite bandaid fixes, look for missing strategy, cultural misalignment, or interpersonal friction as root causes",
    "Minimize opportunity cost instead of maximizing ROI - stop asking 'is this good use of time?' and start asking 'is this the BEST use of time?' to avoid filling your roadmap with quick wins while missing transformative bets",
    "High agency PMs exceed their on-paper potential through strong ownership, creative execution through challenges, and resilience - they find ways to achieve goals without waiting for perfect conditions or blaming circumstances"
  ],
  "zone_influence": {
    "velocity": 0.08,
    "perfection": 0.15,
    "discovery": 0.15,
    "data": 0.2,
    "intuition": 0.05,
    "alignment": 0.08,
    "chaos": 0.09,
    "focus": 0.25
  },
  "contrarian_candidates": [
    {
      "quoteId": "shreyas-doshi-005",
      "why": "Challenges conventional wisdom that execution problems need execution solutions - argues most are actually strategy/culture problems disguised as execution issues",
      "related_zones": [
        "discovery",
        "focus"
      ]
    },
    {
      "quoteId": "shreyas-doshi-007",
      "why": "Goes against ubiquitous ROI-maximization advice - argues that chasing positive ROI leads to quick wins addiction and missing transformative opportunities",
      "related_zones": [
        "focus",
        "data"
      ]
    },
    {
      "quoteId": "shreyas-doshi-011",
      "why": "Reveals Google's contrarian filter of ignoring $100M opportunities - most companies would celebrate such wins, but thinking bigger meant only pursuing billion-dollar bets",
      "related_zones": [
        "focus",
        "velocity"
      ]
    }
  ],
  "guest_metadata": {
    "guest_type": "operator",
    "company_stage": "public",
    "primary_topics": [
      "frameworks",
      "prioritization",
      "lno",
      "pre-mortems",
      "career"
    ]
  }
}
